In [13]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

# show start of df
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [5]:
# show end of df
school_data_complete.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [7]:
school_data_complete.describe

<bound method NDFrame.describe of        Student ID       student_name gender grade         school_name  \
0               0       Paul Bradley      M   9th   Huang High School
1               1       Victor Smith      M  12th   Huang High School
2               2    Kevin Rodriguez      M  12th   Huang High School
3               3  Dr. Richard Scott      M  12th   Huang High School
4               4         Bonnie Ray      F   9th   Huang High School
...           ...                ...    ...   ...                 ...
39165       39165       Donna Howard      F  12th  Thomas High School
39166       39166          Dawn Bell      F  10th  Thomas High School
39167       39167     Rebecca Tanner      F   9th  Thomas High School
39168       39168       Desiree Kidd      F  10th  Thomas High School
39169       39169    Carolyn Jackson      F  11th  Thomas High School

       reading_score  math_score  School ID      type  size   budget
0                 66          79          0  District  2917  1910635
1                 94          61          0  District  2917  1910635
2                 90          60          0  District  2917  1910635
3                 67          58          0  District  2917  1910635
4                 97          84          0  District  2917  1910635
...              ...         ...        ...       ...   ...      ...
39165             99          90         14   Charter  1635  1043130
39166             95          70         14   Charter  1635  1043130
39167             73          84         14   Charter  1635  1043130
39168             99          90         14   Charter  1635  1043130
39169             95          75         14   Charter  1635  1043130

[39170 rows x 11 columns]>

In [14]:
# check for incomplete columns
count = school_data_complete.count()
count

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [22]:
# find count of schools
ind_schools = school_data_complete["school_name"].unique()
total_schools = len(ind_schools)
total_schools

15

In [19]:
# find total count of students

total_students = school_data_complete["Student ID"].count()
total_students

39170

In [26]:
# create new df using groupby of each school to help determine budgets for each school
grouped_schools_df = school_data_complete.groupby(["school_name"])
grouped_schools_df.head()
grouped_schools_df.count().head

<bound method NDFrame.head of                        Student ID  student_name  gender  grade  reading_score  \
school_name
Bailey High School           4976          4976    4976   4976           4976
Cabrera High School          1858          1858    1858   1858           1858
Figueroa High School         2949          2949    2949   2949           2949
Ford High School             2739          2739    2739   2739           2739
Griffin High School          1468          1468    1468   1468           1468
Hernandez High School        4635          4635    4635   4635           4635
Holden High School            427           427     427    427            427
Huang High School            2917          2917    2917   2917           2917
Johnson High School          4761          4761    4761   4761           4761
Pena High School              962           962     962    962            962
Rodriguez High School        3999          3999    3999   3999           3999
Shelton High School          1761          1761    1761   1761           1761
Thomas High School           1635          1635    1635   1635           1635
Wilson High School           2283          2283    2283   2283           2283
Wright High School           1800          1800    1800   1800           1800

                       math_score  School ID  type  size  budget
school_name
Bailey High School           4976       4976  4976  4976    4976
Cabrera High School          1858       1858  1858  1858    1858
Figueroa High School         2949       2949  2949  2949    2949
Ford High School             2739       2739  2739  2739    2739
Griffin High School          1468       1468  1468  1468    1468
Hernandez High School        4635       4635  4635  4635    4635
Holden High School            427        427   427   427     427
Huang High School            2917       2917  2917  2917    2917
Johnson High School          4761       4761  4761  4761    4761
Pena High School              962        962   962   962     962
Rodriguez High School        3999       3999  3999  3999    3999
Shelton High School          1761       1761  1761  1761    1761
Thomas High School           1635       1635  1635  1635    1635
Wilson High School           2283       2283  2283  2283    2283
Wright High School           1800       1800  1800  1800    1800  >

In [34]:
total_budget = grouped_schools_df["size"].sum()
total_budget

school_name
Bailey High School       24760576
Cabrera High School       3452164
Figueroa High School      8696601
Ford High School          7502121
Griffin High School       2155024
Hernandez High School    21483225
Holden High School         182329
Huang High School         8508889
Johnson High School      22667121
Pena High School           925444
Rodriguez High School    15992001
Shelton High School       3101121
Thomas High School        2673225
Wilson High School        5212089
Wright High School        3240000
Name: size, dtype: int64